ataradov/mcu-starter-projects/samg53/include/component/pdc.h
/**
 * \file
 *
 * \brief Component description for PDC
 *
 * Copyright (c) 2017 Atmel Corporation, a wholly owned subsidiary of Microchip Technology Inc.
 *
 * \license_start
 *
 * \page License
 *
 * Licensed under the Apache License, Version 2.0 (the "License");
 * you may not use this file except in compliance with the License.
 * You may obtain a copy of the License at
 *
 *   http://www.apache.org/licenses/LICENSE-2.0
 *
 * Unless required by applicable law or agreed to in writing, software
 * distributed under the License is distributed on an "AS IS" BASIS,
 * WITHOUT WARRANTIES OR CONDITIONS OF ANY KIND, either express or implied.
 * See the License for the specific language governing permissions and
 * limitations under the License.
 *
 * \license_stop
 *
 */

/* file generated from device description version 2017-07-05T18:00:00Z */
#ifndef _SAMG53_PDC_COMPONENT_H_
#define _SAMG53_PDC_COMPONENT_H_
#define _SAMG53_PDC_COMPONENT_         /**< \deprecated  Backward compatibility for ASF */

/** \addtogroup SAMG_SAMG53 Peripheral DMA Controller
 *  @{
 */
/* ========================================================================== */
/**  SOFTWARE API DEFINITION FOR PDC */
/* ========================================================================== */
#ifndef COMPONENT_TYPEDEF_STYLE
  #define COMPONENT_TYPEDEF_STYLE 'R'  /**< Defines default style of typedefs for the component header files ('R' = RFO, 'N' = NTO)*/
#endif

#define PDC_6031                       /**< (PDC) Module ID */
#define REV_PDC I                      /**< (PDC) Module revision */

/* -------- PDC_PERIPH_RPR : (PDC Offset: 0x00) (R/W 32) Receive Pointer Register -------- */
#if !(defined(__ASSEMBLER__) || defined(__IAR_SYSTEMS_ASM__))
typedef union { 
  struct {
    uint32_t RXPTR:32;                  /**< bit:  0..31  Receive Pointer Register                 */
  } bit;                                /**< Structure used for bit  access */
  uint32_t reg;                         /**< Type used for register access */
} PDC_PERIPH_RPR_Type;
#endif /* !(defined(__ASSEMBLER__) || defined(__IAR_SYSTEMS_ASM__)) */

#define PDC_PERIPH_RPR_OFFSET               (0x00)                                        /**<  (PDC_PERIPH_RPR) Receive Pointer Register  Offset */

#define PDC_PERIPH_RPR_RXPTR_Pos            0                                              /**< (PDC_PERIPH_RPR) Receive Pointer Register Position */
#define PDC_PERIPH_RPR_RXPTR_Msk            (_U_(0xFFFFFFFF) << PDC_PERIPH_RPR_RXPTR_Pos)  /**< (PDC_PERIPH_RPR) Receive Pointer Register Mask */
#define PDC_PERIPH_RPR_RXPTR(value)         (PDC_PERIPH_RPR_RXPTR_Msk & ((value) << PDC_PERIPH_RPR_RXPTR_Pos))
#define PDC_PERIPH_RPR_MASK                 _U_(0xFFFFFFFF)                                /**< \deprecated (PDC_PERIPH_RPR) Register MASK  (Use PDC_PERIPH_RPR_Msk instead)  */
#define PDC_PERIPH_RPR_Msk                  _U_(0xFFFFFFFF)                                /**< (PDC_PERIPH_RPR) Register Mask  */


/* -------- PDC_PERIPH_RCR : (PDC Offset: 0x04) (R/W 32) Receive Counter Register -------- */
#if !(defined(__ASSEMBLER__) || defined(__IAR_SYSTEMS_ASM__))
typedef union { 
  struct {
    uint32_t RXCTR:16;                  /**< bit:  0..15  Receive Counter Register                 */
    uint32_t :16;                       /**< bit: 16..31  Reserved */
  } bit;                                /**< Structure used for bit  access */
  uint32_t reg;                         /**< Type used for register access */
} PDC_PERIPH_RCR_Type;
#endif /* !(defined(__ASSEMBLER__) || defined(__IAR_SYSTEMS_ASM__)) */

#define PDC_PERIPH_RCR_OFFSET               (0x04)                                        /**<  (PDC_PERIPH_RCR) Receive Counter Register  Offset */

#define PDC_PERIPH_RCR_RXCTR_Pos            0                                              /**< (PDC_PERIPH_RCR) Receive Counter Register Position */
#define PDC_PERIPH_RCR_RXCTR_Msk            (_U_(0xFFFF) << PDC_PERIPH_RCR_RXCTR_Pos)      /**< (PDC_PERIPH_RCR) Receive Counter Register Mask */
#define PDC_PERIPH_RCR_RXCTR(value)         (PDC_PERIPH_RCR_RXCTR_Msk & ((value) << PDC_PERIPH_RCR_RXCTR_Pos))
#define PDC_PERIPH_RCR_MASK                 _U_(0xFFFF)                                    /**< \deprecated (PDC_PERIPH_RCR) Register MASK  (Use PDC_PERIPH_RCR_Msk instead)  */
#define PDC_PERIPH_RCR_Msk                  _U_(0xFFFF)                                    /**< (PDC_PERIPH_RCR) Register Mask  */


/* -------- PDC_PERIPH_TPR : (PDC Offset: 0x08) (R/W 32) Transmit Pointer Register -------- */
#if !(defined(__ASSEMBLER__) || defined(__IAR_SYSTEMS_ASM__))
typedef union { 
  struct {
    uint32_t TXPTR:32;                  /**< bit:  0..31  Transmit Counter Register                */
  } bit;                                /**< Structure used for bit  access */
  uint32_t reg;                         /**< Type used for register access */
} PDC_PERIPH_TPR_Type;
#endif /* !(defined(__ASSEMBLER__) || defined(__IAR_SYSTEMS_ASM__)) */

#define PDC_PERIPH_TPR_OFFSET               (0x08)                                        /**<  (PDC_PERIPH_TPR) Transmit Pointer Register  Offset */

#define PDC_PERIPH_TPR_TXPTR_Pos            0                                              /**< (PDC_PERIPH_TPR) Transmit Counter Register Position */
#define PDC_PERIPH_TPR_TXPTR_Msk            (_U_(0xFFFFFFFF) << PDC_PERIPH_TPR_TXPTR_Pos)  /**< (PDC_PERIPH_TPR) Transmit Counter Register Mask */
#define PDC_PERIPH_TPR_TXPTR(value)         (PDC_PERIPH_TPR_TXPTR_Msk & ((value) << PDC_PERIPH_TPR_TXPTR_Pos))
#define PDC_PERIPH_TPR_MASK                 _U_(0xFFFFFFFF)                                /**< \deprecated (PDC_PERIPH_TPR) Register MASK  (Use PDC_PERIPH_TPR_Msk instead)  */
#define PDC_PERIPH_TPR_Msk                  _U_(0xFFFFFFFF)                                /**< (PDC_PERIPH_TPR) Register Mask  */


/* -------- PDC_PERIPH_TCR : (PDC Offset: 0x0c) (R/W 32) Transmit Counter Register -------- */
#if !(defined(__ASSEMBLER__) || defined(__IAR_SYSTEMS_ASM__))
typedef union { 
  struct {
    uint32_t TXCTR:16;                  /**< bit:  0..15  Transmit Counter Register                */
    uint32_t :16;                       /**< bit: 16..31  Reserved */
  } bit;                                /**< Structure used for bit  access */
  uint32_t reg;                         /**< Type used for register access */
} PDC_PERIPH_TCR_Type;
