ataradov/mcu-starter-projects/samg53/include/component/pdc.h
#endif /* !(defined(__ASSEMBLER__) || defined(__IAR_SYSTEMS_ASM__)) */

#define PDC_PERIPH_TCR_OFFSET               (0x0C)                                        /**<  (PDC_PERIPH_TCR) Transmit Counter Register  Offset */

#define PDC_PERIPH_TCR_TXCTR_Pos            0                                              /**< (PDC_PERIPH_TCR) Transmit Counter Register Position */
#define PDC_PERIPH_TCR_TXCTR_Msk            (_U_(0xFFFF) << PDC_PERIPH_TCR_TXCTR_Pos)      /**< (PDC_PERIPH_TCR) Transmit Counter Register Mask */
#define PDC_PERIPH_TCR_TXCTR(value)         (PDC_PERIPH_TCR_TXCTR_Msk & ((value) << PDC_PERIPH_TCR_TXCTR_Pos))
#define PDC_PERIPH_TCR_MASK                 _U_(0xFFFF)                                    /**< \deprecated (PDC_PERIPH_TCR) Register MASK  (Use PDC_PERIPH_TCR_Msk instead)  */
#define PDC_PERIPH_TCR_Msk                  _U_(0xFFFF)                                    /**< (PDC_PERIPH_TCR) Register Mask  */


/* -------- PDC_PERIPH_RNPR : (PDC Offset: 0x10) (R/W 32) Receive Next Pointer Register -------- */
#if !(defined(__ASSEMBLER__) || defined(__IAR_SYSTEMS_ASM__))
typedef union { 
  struct {
    uint32_t RXNPTR:32;                 /**< bit:  0..31  Receive Next Pointer                     */
  } bit;                                /**< Structure used for bit  access */
  uint32_t reg;                         /**< Type used for register access */
} PDC_PERIPH_RNPR_Type;
#endif /* !(defined(__ASSEMBLER__) || defined(__IAR_SYSTEMS_ASM__)) */

#define PDC_PERIPH_RNPR_OFFSET              (0x10)                                        /**<  (PDC_PERIPH_RNPR) Receive Next Pointer Register  Offset */

#define PDC_PERIPH_RNPR_RXNPTR_Pos          0                                              /**< (PDC_PERIPH_RNPR) Receive Next Pointer Position */
#define PDC_PERIPH_RNPR_RXNPTR_Msk          (_U_(0xFFFFFFFF) << PDC_PERIPH_RNPR_RXNPTR_Pos)  /**< (PDC_PERIPH_RNPR) Receive Next Pointer Mask */
#define PDC_PERIPH_RNPR_RXNPTR(value)       (PDC_PERIPH_RNPR_RXNPTR_Msk & ((value) << PDC_PERIPH_RNPR_RXNPTR_Pos))
#define PDC_PERIPH_RNPR_MASK                _U_(0xFFFFFFFF)                                /**< \deprecated (PDC_PERIPH_RNPR) Register MASK  (Use PDC_PERIPH_RNPR_Msk instead)  */
#define PDC_PERIPH_RNPR_Msk                 _U_(0xFFFFFFFF)                                /**< (PDC_PERIPH_RNPR) Register Mask  */


/* -------- PDC_PERIPH_RNCR : (PDC Offset: 0x14) (R/W 32) Receive Next Counter Register -------- */
#if !(defined(__ASSEMBLER__) || defined(__IAR_SYSTEMS_ASM__))
typedef union { 
  struct {
    uint32_t RXNCTR:16;                 /**< bit:  0..15  Receive Next Counter                     */
    uint32_t :16;                       /**< bit: 16..31  Reserved */
  } bit;                                /**< Structure used for bit  access */
  uint32_t reg;                         /**< Type used for register access */
} PDC_PERIPH_RNCR_Type;
#endif /* !(defined(__ASSEMBLER__) || defined(__IAR_SYSTEMS_ASM__)) */

#define PDC_PERIPH_RNCR_OFFSET              (0x14)                                        /**<  (PDC_PERIPH_RNCR) Receive Next Counter Register  Offset */

#define PDC_PERIPH_RNCR_RXNCTR_Pos          0                                              /**< (PDC_PERIPH_RNCR) Receive Next Counter Position */
#define PDC_PERIPH_RNCR_RXNCTR_Msk          (_U_(0xFFFF) << PDC_PERIPH_RNCR_RXNCTR_Pos)    /**< (PDC_PERIPH_RNCR) Receive Next Counter Mask */
#define PDC_PERIPH_RNCR_RXNCTR(value)       (PDC_PERIPH_RNCR_RXNCTR_Msk & ((value) << PDC_PERIPH_RNCR_RXNCTR_Pos))
#define PDC_PERIPH_RNCR_MASK                _U_(0xFFFF)                                    /**< \deprecated (PDC_PERIPH_RNCR) Register MASK  (Use PDC_PERIPH_RNCR_Msk instead)  */
#define PDC_PERIPH_RNCR_Msk                 _U_(0xFFFF)                                    /**< (PDC_PERIPH_RNCR) Register Mask  */


/* -------- PDC_PERIPH_TNPR : (PDC Offset: 0x18) (R/W 32) Transmit Next Pointer Register -------- */
#if !(defined(__ASSEMBLER__) || defined(__IAR_SYSTEMS_ASM__))
typedef union { 
  struct {
    uint32_t TXNPTR:32;                 /**< bit:  0..31  Transmit Next Pointer                    */
  } bit;                                /**< Structure used for bit  access */
  uint32_t reg;                         /**< Type used for register access */
} PDC_PERIPH_TNPR_Type;
#endif /* !(defined(__ASSEMBLER__) || defined(__IAR_SYSTEMS_ASM__)) */

#define PDC_PERIPH_TNPR_OFFSET              (0x18)                                        /**<  (PDC_PERIPH_TNPR) Transmit Next Pointer Register  Offset */

#define PDC_PERIPH_TNPR_TXNPTR_Pos          0                                              /**< (PDC_PERIPH_TNPR) Transmit Next Pointer Position */
#define PDC_PERIPH_TNPR_TXNPTR_Msk          (_U_(0xFFFFFFFF) << PDC_PERIPH_TNPR_TXNPTR_Pos)  /**< (PDC_PERIPH_TNPR) Transmit Next Pointer Mask */
#define PDC_PERIPH_TNPR_TXNPTR(value)       (PDC_PERIPH_TNPR_TXNPTR_Msk & ((value) << PDC_PERIPH_TNPR_TXNPTR_Pos))
#define PDC_PERIPH_TNPR_MASK                _U_(0xFFFFFFFF)                                /**< \deprecated (PDC_PERIPH_TNPR) Register MASK  (Use PDC_PERIPH_TNPR_Msk instead)  */
#define PDC_PERIPH_TNPR_Msk                 _U_(0xFFFFFFFF)                                /**< (PDC_PERIPH_TNPR) Register Mask  */


/* -------- PDC_PERIPH_TNCR : (PDC Offset: 0x1c) (R/W 32) Transmit Next Counter Register -------- */
#if !(defined(__ASSEMBLER__) || defined(__IAR_SYSTEMS_ASM__))
typedef union { 
  struct {
    uint32_t TXNCTR:16;                 /**< bit:  0..15  Transmit Counter Next                    */
    uint32_t :16;                       /**< bit: 16..31  Reserved */
  } bit;                                /**< Structure used for bit  access */
  uint32_t reg;                         /**< Type used for register access */
} PDC_PERIPH_TNCR_Type;
#endif /* !(defined(__ASSEMBLER__) || defined(__IAR_SYSTEMS_ASM__)) */

#define PDC_PERIPH_TNCR_OFFSET              (0x1C)                                        /**<  (PDC_PERIPH_TNCR) Transmit Next Counter Register  Offset */

#define PDC_PERIPH_TNCR_TXNCTR_Pos          0                                              /**< (PDC_PERIPH_TNCR) Transmit Counter Next Position */
#define PDC_PERIPH_TNCR_TXNCTR_Msk          (_U_(0xFFFF) << PDC_PERIPH_TNCR_TXNCTR_Pos)    /**< (PDC_PERIPH_TNCR) Transmit Counter Next Mask */
#define PDC_PERIPH_TNCR_TXNCTR(value)       (PDC_PERIPH_TNCR_TXNCTR_Msk & ((value) << PDC_PERIPH_TNCR_TXNCTR_Pos))
#define PDC_PERIPH_TNCR_MASK                _U_(0xFFFF)                                    /**< \deprecated (PDC_PERIPH_TNCR) Register MASK  (Use PDC_PERIPH_TNCR_Msk instead)  */
#define PDC_PERIPH_TNCR_Msk                 _U_(0xFFFF)                                    /**< (PDC_PERIPH_TNCR) Register Mask  */


/* -------- PDC_PERIPH_PTCR : (PDC Offset: 0x20) (/W 32) Transfer Control Register -------- */
#if !(defined(__ASSEMBLER__) || defined(__IAR_SYSTEMS_ASM__))
typedef union { 
  struct {
    uint32_t RXTEN:1;                   /**< bit:      0  Receiver Transfer Enable                 */
    uint32_t RXTDIS:1;                  /**< bit:      1  Receiver Transfer Disable                */
    uint32_t :6;                        /**< bit:   2..7  Reserved */
    uint32_t TXTEN:1;                   /**< bit:      8  Transmitter Transfer Enable              */
    uint32_t TXTDIS:1;                  /**< bit:      9  Transmitter Transfer Disable             */
    uint32_t :6;                        /**< bit: 10..15  Reserved */
    uint32_t RXCBEN:1;                  /**< bit:     16  Receiver Circular Buffer Enable          */
    uint32_t RXCBDIS:1;                 /**< bit:     17  Receiver Circular Buffer Disable         */
    uint32_t TXCBEN:1;                  /**< bit:     18  Transmitter Circular Buffer Enable       */
    uint32_t TXCBDIS:1;                 /**< bit:     19  Transmitter Circular Buffer Disable      */
    uint32_t :4;                        /**< bit: 20..23  Reserved */
    uint32_t ERRCLR:1;                  /**< bit:     24  Transfer Bus Error Clear                 */
    uint32_t :7;                        /**< bit: 25..31  Reserved */
  } bit;                                /**< Structure used for bit  access */
  uint32_t reg;                         /**< Type used for register access */
} PDC_PERIPH_PTCR_Type;
