ataradov/mcu-starter-projects/samg53/include/component/pdc.h
#endif /* !(defined(__ASSEMBLER__) || defined(__IAR_SYSTEMS_ASM__)) */

#define PDC_PERIPH_PTCR_OFFSET              (0x20)                                        /**<  (PDC_PERIPH_PTCR) Transfer Control Register  Offset */

#define PDC_PERIPH_PTCR_RXTEN_Pos           0                                              /**< (PDC_PERIPH_PTCR) Receiver Transfer Enable Position */
#define PDC_PERIPH_PTCR_RXTEN_Msk           (_U_(0x1) << PDC_PERIPH_PTCR_RXTEN_Pos)        /**< (PDC_PERIPH_PTCR) Receiver Transfer Enable Mask */
#define PDC_PERIPH_PTCR_RXTEN               PDC_PERIPH_PTCR_RXTEN_Msk                      /**< \deprecated Old style mask definition for 1 bit bitfield. Use PDC_PERIPH_PTCR_RXTEN_Msk instead */
#define PDC_PERIPH_PTCR_RXTDIS_Pos          1                                              /**< (PDC_PERIPH_PTCR) Receiver Transfer Disable Position */
#define PDC_PERIPH_PTCR_RXTDIS_Msk          (_U_(0x1) << PDC_PERIPH_PTCR_RXTDIS_Pos)       /**< (PDC_PERIPH_PTCR) Receiver Transfer Disable Mask */
#define PDC_PERIPH_PTCR_RXTDIS              PDC_PERIPH_PTCR_RXTDIS_Msk                     /**< \deprecated Old style mask definition for 1 bit bitfield. Use PDC_PERIPH_PTCR_RXTDIS_Msk instead */
#define PDC_PERIPH_PTCR_TXTEN_Pos           8                                              /**< (PDC_PERIPH_PTCR) Transmitter Transfer Enable Position */
#define PDC_PERIPH_PTCR_TXTEN_Msk           (_U_(0x1) << PDC_PERIPH_PTCR_TXTEN_Pos)        /**< (PDC_PERIPH_PTCR) Transmitter Transfer Enable Mask */
#define PDC_PERIPH_PTCR_TXTEN               PDC_PERIPH_PTCR_TXTEN_Msk                      /**< \deprecated Old style mask definition for 1 bit bitfield. Use PDC_PERIPH_PTCR_TXTEN_Msk instead */
#define PDC_PERIPH_PTCR_TXTDIS_Pos          9                                              /**< (PDC_PERIPH_PTCR) Transmitter Transfer Disable Position */
#define PDC_PERIPH_PTCR_TXTDIS_Msk          (_U_(0x1) << PDC_PERIPH_PTCR_TXTDIS_Pos)       /**< (PDC_PERIPH_PTCR) Transmitter Transfer Disable Mask */
#define PDC_PERIPH_PTCR_TXTDIS              PDC_PERIPH_PTCR_TXTDIS_Msk                     /**< \deprecated Old style mask definition for 1 bit bitfield. Use PDC_PERIPH_PTCR_TXTDIS_Msk instead */
#define PDC_PERIPH_PTCR_RXCBEN_Pos          16                                             /**< (PDC_PERIPH_PTCR) Receiver Circular Buffer Enable Position */
#define PDC_PERIPH_PTCR_RXCBEN_Msk          (_U_(0x1) << PDC_PERIPH_PTCR_RXCBEN_Pos)       /**< (PDC_PERIPH_PTCR) Receiver Circular Buffer Enable Mask */
#define PDC_PERIPH_PTCR_RXCBEN              PDC_PERIPH_PTCR_RXCBEN_Msk                     /**< \deprecated Old style mask definition for 1 bit bitfield. Use PDC_PERIPH_PTCR_RXCBEN_Msk instead */
#define PDC_PERIPH_PTCR_RXCBDIS_Pos         17                                             /**< (PDC_PERIPH_PTCR) Receiver Circular Buffer Disable Position */
#define PDC_PERIPH_PTCR_RXCBDIS_Msk         (_U_(0x1) << PDC_PERIPH_PTCR_RXCBDIS_Pos)      /**< (PDC_PERIPH_PTCR) Receiver Circular Buffer Disable Mask */
#define PDC_PERIPH_PTCR_RXCBDIS             PDC_PERIPH_PTCR_RXCBDIS_Msk                    /**< \deprecated Old style mask definition for 1 bit bitfield. Use PDC_PERIPH_PTCR_RXCBDIS_Msk instead */
#define PDC_PERIPH_PTCR_TXCBEN_Pos          18                                             /**< (PDC_PERIPH_PTCR) Transmitter Circular Buffer Enable Position */
#define PDC_PERIPH_PTCR_TXCBEN_Msk          (_U_(0x1) << PDC_PERIPH_PTCR_TXCBEN_Pos)       /**< (PDC_PERIPH_PTCR) Transmitter Circular Buffer Enable Mask */
#define PDC_PERIPH_PTCR_TXCBEN              PDC_PERIPH_PTCR_TXCBEN_Msk                     /**< \deprecated Old style mask definition for 1 bit bitfield. Use PDC_PERIPH_PTCR_TXCBEN_Msk instead */
#define PDC_PERIPH_PTCR_TXCBDIS_Pos         19                                             /**< (PDC_PERIPH_PTCR) Transmitter Circular Buffer Disable Position */
#define PDC_PERIPH_PTCR_TXCBDIS_Msk         (_U_(0x1) << PDC_PERIPH_PTCR_TXCBDIS_Pos)      /**< (PDC_PERIPH_PTCR) Transmitter Circular Buffer Disable Mask */
#define PDC_PERIPH_PTCR_TXCBDIS             PDC_PERIPH_PTCR_TXCBDIS_Msk                    /**< \deprecated Old style mask definition for 1 bit bitfield. Use PDC_PERIPH_PTCR_TXCBDIS_Msk instead */
#define PDC_PERIPH_PTCR_ERRCLR_Pos          24                                             /**< (PDC_PERIPH_PTCR) Transfer Bus Error Clear Position */
#define PDC_PERIPH_PTCR_ERRCLR_Msk          (_U_(0x1) << PDC_PERIPH_PTCR_ERRCLR_Pos)       /**< (PDC_PERIPH_PTCR) Transfer Bus Error Clear Mask */
#define PDC_PERIPH_PTCR_ERRCLR              PDC_PERIPH_PTCR_ERRCLR_Msk                     /**< \deprecated Old style mask definition for 1 bit bitfield. Use PDC_PERIPH_PTCR_ERRCLR_Msk instead */
#define PDC_PERIPH_PTCR_MASK                _U_(0x10F0303)                                 /**< \deprecated (PDC_PERIPH_PTCR) Register MASK  (Use PDC_PERIPH_PTCR_Msk instead)  */
#define PDC_PERIPH_PTCR_Msk                 _U_(0x10F0303)                                 /**< (PDC_PERIPH_PTCR) Register Mask  */


/* -------- PDC_PERIPH_PTSR : (PDC Offset: 0x24) (R/ 32) Transfer Status Register -------- */
#if !(defined(__ASSEMBLER__) || defined(__IAR_SYSTEMS_ASM__))
typedef union { 
  struct {
    uint32_t RXTEN:1;                   /**< bit:      0  Receiver Transfer Enable                 */
    uint32_t :7;                        /**< bit:   1..7  Reserved */
    uint32_t TXTEN:1;                   /**< bit:      8  Transmitter Transfer Enable              */
    uint32_t :7;                        /**< bit:  9..15  Reserved */
    uint32_t RXCBEN:1;                  /**< bit:     16  Receiver Circular Buffer Enable          */
    uint32_t :1;                        /**< bit:     17  Reserved */
    uint32_t TXCBEN:1;                  /**< bit:     18  Transmitter Circular Buffer Enable       */
    uint32_t :5;                        /**< bit: 19..23  Reserved */
    uint32_t ERR:1;                     /**< bit:     24  Transfer Bus Error                       */
    uint32_t :7;                        /**< bit: 25..31  Reserved */
  } bit;                                /**< Structure used for bit  access */
  uint32_t reg;                         /**< Type used for register access */
} PDC_PERIPH_PTSR_Type;
