ataradov/mcu-starter-projects/samg53/include/component/pdc.h
#endif /* !(defined(__ASSEMBLER__) || defined(__IAR_SYSTEMS_ASM__)) */

#define PDC_PERIPH_PTSR_OFFSET              (0x24)                                        /**<  (PDC_PERIPH_PTSR) Transfer Status Register  Offset */

#define PDC_PERIPH_PTSR_RXTEN_Pos           0                                              /**< (PDC_PERIPH_PTSR) Receiver Transfer Enable Position */
#define PDC_PERIPH_PTSR_RXTEN_Msk           (_U_(0x1) << PDC_PERIPH_PTSR_RXTEN_Pos)        /**< (PDC_PERIPH_PTSR) Receiver Transfer Enable Mask */
#define PDC_PERIPH_PTSR_RXTEN               PDC_PERIPH_PTSR_RXTEN_Msk                      /**< \deprecated Old style mask definition for 1 bit bitfield. Use PDC_PERIPH_PTSR_RXTEN_Msk instead */
#define PDC_PERIPH_PTSR_TXTEN_Pos           8                                              /**< (PDC_PERIPH_PTSR) Transmitter Transfer Enable Position */
#define PDC_PERIPH_PTSR_TXTEN_Msk           (_U_(0x1) << PDC_PERIPH_PTSR_TXTEN_Pos)        /**< (PDC_PERIPH_PTSR) Transmitter Transfer Enable Mask */
#define PDC_PERIPH_PTSR_TXTEN               PDC_PERIPH_PTSR_TXTEN_Msk                      /**< \deprecated Old style mask definition for 1 bit bitfield. Use PDC_PERIPH_PTSR_TXTEN_Msk instead */
#define PDC_PERIPH_PTSR_RXCBEN_Pos          16                                             /**< (PDC_PERIPH_PTSR) Receiver Circular Buffer Enable Position */
#define PDC_PERIPH_PTSR_RXCBEN_Msk          (_U_(0x1) << PDC_PERIPH_PTSR_RXCBEN_Pos)       /**< (PDC_PERIPH_PTSR) Receiver Circular Buffer Enable Mask */
#define PDC_PERIPH_PTSR_RXCBEN              PDC_PERIPH_PTSR_RXCBEN_Msk                     /**< \deprecated Old style mask definition for 1 bit bitfield. Use PDC_PERIPH_PTSR_RXCBEN_Msk instead */
#define PDC_PERIPH_PTSR_TXCBEN_Pos          18                                             /**< (PDC_PERIPH_PTSR) Transmitter Circular Buffer Enable Position */
#define PDC_PERIPH_PTSR_TXCBEN_Msk          (_U_(0x1) << PDC_PERIPH_PTSR_TXCBEN_Pos)       /**< (PDC_PERIPH_PTSR) Transmitter Circular Buffer Enable Mask */
#define PDC_PERIPH_PTSR_TXCBEN              PDC_PERIPH_PTSR_TXCBEN_Msk                     /**< \deprecated Old style mask definition for 1 bit bitfield. Use PDC_PERIPH_PTSR_TXCBEN_Msk instead */
#define PDC_PERIPH_PTSR_ERR_Pos             24                                             /**< (PDC_PERIPH_PTSR) Transfer Bus Error Position */
#define PDC_PERIPH_PTSR_ERR_Msk             (_U_(0x1) << PDC_PERIPH_PTSR_ERR_Pos)          /**< (PDC_PERIPH_PTSR) Transfer Bus Error Mask */
#define PDC_PERIPH_PTSR_ERR                 PDC_PERIPH_PTSR_ERR_Msk                        /**< \deprecated Old style mask definition for 1 bit bitfield. Use PDC_PERIPH_PTSR_ERR_Msk instead */
#define PDC_PERIPH_PTSR_MASK                _U_(0x1050101)                                 /**< \deprecated (PDC_PERIPH_PTSR) Register MASK  (Use PDC_PERIPH_PTSR_Msk instead)  */
#define PDC_PERIPH_PTSR_Msk                 _U_(0x1050101)                                 /**< (PDC_PERIPH_PTSR) Register Mask  */


#if !(defined(__ASSEMBLER__) || defined(__IAR_SYSTEMS_ASM__))
#if COMPONENT_TYPEDEF_STYLE == 'R'
/** \brief PDC hardware registers */
typedef struct {  
  __IO uint32_t PERIPH_RPR;     /**< (PDC Offset: 0x00) Receive Pointer Register */
  __IO uint32_t PERIPH_RCR;     /**< (PDC Offset: 0x04) Receive Counter Register */
  __IO uint32_t PERIPH_TPR;     /**< (PDC Offset: 0x08) Transmit Pointer Register */
  __IO uint32_t PERIPH_TCR;     /**< (PDC Offset: 0x0C) Transmit Counter Register */
  __IO uint32_t PERIPH_RNPR;    /**< (PDC Offset: 0x10) Receive Next Pointer Register */
  __IO uint32_t PERIPH_RNCR;    /**< (PDC Offset: 0x14) Receive Next Counter Register */
  __IO uint32_t PERIPH_TNPR;    /**< (PDC Offset: 0x18) Transmit Next Pointer Register */
  __IO uint32_t PERIPH_TNCR;    /**< (PDC Offset: 0x1C) Transmit Next Counter Register */
  __O  uint32_t PERIPH_PTCR;    /**< (PDC Offset: 0x20) Transfer Control Register */
  __I  uint32_t PERIPH_PTSR;    /**< (PDC Offset: 0x24) Transfer Status Register */
} Pdc;

#elif COMPONENT_TYPEDEF_STYLE == 'N'
/** \brief PDC hardware registers */
typedef struct {  
  __IO PDC_PERIPH_RPR_Type            PERIPH_RPR;     /**< Offset: 0x00 (R/W  32) Receive Pointer Register */
  __IO PDC_PERIPH_RCR_Type            PERIPH_RCR;     /**< Offset: 0x04 (R/W  32) Receive Counter Register */
  __IO PDC_PERIPH_TPR_Type            PERIPH_TPR;     /**< Offset: 0x08 (R/W  32) Transmit Pointer Register */
  __IO PDC_PERIPH_TCR_Type            PERIPH_TCR;     /**< Offset: 0x0C (R/W  32) Transmit Counter Register */
  __IO PDC_PERIPH_RNPR_Type           PERIPH_RNPR;    /**< Offset: 0x10 (R/W  32) Receive Next Pointer Register */
  __IO PDC_PERIPH_RNCR_Type           PERIPH_RNCR;    /**< Offset: 0x14 (R/W  32) Receive Next Counter Register */
  __IO PDC_PERIPH_TNPR_Type           PERIPH_TNPR;    /**< Offset: 0x18 (R/W  32) Transmit Next Pointer Register */
  __IO PDC_PERIPH_TNCR_Type           PERIPH_TNCR;    /**< Offset: 0x1C (R/W  32) Transmit Next Counter Register */
  __O  PDC_PERIPH_PTCR_Type           PERIPH_PTCR;    /**< Offset: 0x20 ( /W  32) Transfer Control Register */
  __I  PDC_PERIPH_PTSR_Type           PERIPH_PTSR;    /**< Offset: 0x24 (R/   32) Transfer Status Register */
} Pdc;

#else /* COMPONENT_TYPEDEF_STYLE */
#error Unknown component typedef style
#endif /* COMPONENT_TYPEDEF_STYLE */

#endif /* !(defined(__ASSEMBLER__) || defined(__IAR_SYSTEMS_ASM__)) */
/** @}  end of Peripheral DMA Controller */

#endif /* _SAMG53_PDC_COMPONENT_H_ */
